## Indexes

- Indexes
    - Identifiers for rows
    - Unique value for each row
    - Unnamed column

In [1]:
import pandas as pd
df=pd.DataFrame(
{
    'name':['sahil','sonia','sourav'],
    'age':[10,20,30],
    'gender':['M','F','M']
})

In [2]:
df

     name  age gender
0   sahil   10      M
1   sonia   20      F
2  sourav   30      M

### See the index

In [3]:
df.index

RangeIndex(start=0, stop=3, step=1)

### Set some column as index

In [4]:
df.set_index('name',inplace=True)
df

        age gender
name
sahil    10      M
sonia    20      F
sourav   30      M

In [5]:
df.index

Index(['sahil', 'sonia', 'sourav'], dtype='object', name='name')

In [6]:
# df.loc[0] # earlier with default indexes not intutitive
df.loc['sahil'] # More intuitive
df.loc['sahil','gender']

'M'

In [7]:
df.iloc[0] # Note: iloc will still take integer index.i can only take indexes(in integers)

age       10
gender     M
Name: sahil, dtype: object

### Resetting Index

In [8]:
df.reset_index(inplace=True)

In [9]:
df

     name  age gender
0   sahil   10      M
1   sonia   20      F
2  sourav   30      M

### Setting indexes directly while loading/creating dataframe

In [10]:
df=pd.read_csv('demo.csv')

In [11]:
df

             Name Hire Date   Salary  Sick Days remaining
0  Graham Chapman  03/15/14  50000.0                   10
1     John Cleese  06/01/15  65000.0                    8
2       Eric Idle  05/12/14  45000.0                   10
3     Terry Jones  11/01/13  70000.0                    3
4   Terry Gilliam  08/12/14  48000.0                    7
5   Michael Palin  05/23/13  66000.0                    8

In [12]:
df=pd.read_csv('demo.csv',index_col="Name")

In [13]:
df

               Hire Date   Salary  Sick Days remaining
Name
Graham Chapman  03/15/14  50000.0                   10
John Cleese     06/01/15  65000.0                    8
Eric Idle       05/12/14  45000.0                   10
Terry Jones     11/01/13  70000.0                    3
Terry Gilliam   08/12/14  48000.0                    7
Michael Palin   05/23/13  66000.0                    8